## Python Libraries - Pandas - Pandas Basics


There are two main data structures in Pandas:
- Series
- Dataframes 

The default way to store data is dataframes, and thus manipulating dataframes quickly is probably the most important skill set for data analysis.

In [2]:
# import pandas, pd is an alias
import pandas as pd

### The Pandas Series 

A series is similar to a 1-D numpy array, and contains scalar values of the same type (numeric, character, datetime etc.). 
A dataframe is simply a table where each column is a pandas series.

In [4]:
# Creating a numeric pandas series
s = pd.Series([2, 4, 5, 6, 9])
print(s)
print(type(s))

0    2
1    4
2    5
3    6
4    9
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
# creating a series of type datetime
date_series = pd.date_range(start = '11-09-2017', end = '12-12-2017')
print(date_series)
type(date_series)

DatetimeIndex(['2017-11-09', '2017-11-10', '2017-11-11', '2017-11-12',
               '2017-11-13', '2017-11-14', '2017-11-15', '2017-11-16',
               '2017-11-17', '2017-11-18', '2017-11-19', '2017-11-20',
               '2017-11-21', '2017-11-22', '2017-11-23', '2017-11-24',
               '2017-11-25', '2017-11-26', '2017-11-27', '2017-11-28',
               '2017-11-29', '2017-11-30', '2017-12-01', '2017-12-02',
               '2017-12-03', '2017-12-04', '2017-12-05', '2017-12-06',
               '2017-12-07', '2017-12-08', '2017-12-09', '2017-12-10',
               '2017-12-11', '2017-12-12'],
              dtype='datetime64[ns]', freq='D')

pandas.core.indexes.datetimes.DatetimeIndex

Note that each element in the Series has an index, and the index starts at 0 as usual.

### The Pandas Dataframe 

Dataframe is the most widely used data-structure in data analysis. It is a table with rows and columns, with rows having an index and columns having meaningful names.

There are various ways of creating dataframes, such as creating them from dictionaries, JSON objects, reading from txt, CSV files, etc.

#### Creating dataframes from dictionaries

In [4]:
# Defining data to create lists for dictionary
cars_per_cap = [809, 731, 588, 18, 200, 70, 45]
country = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
drives_right = [False, True, True, True, False, False, False]
cars = pd.DataFrame(country,columns=['column 1'])
cars

        column 1
0  United States
1      Australia
2          Japan
3          India
4         Russia
5        Morocco
6          Egypt

In [5]:
# Creating the dictionaries to store the entries as key-value pair.
cars_dict = {"cars_per_cap" : cars_per_cap, "country" : country, "drives_right" : drives_right }

# Create the dataframe 'cars'
cars = pd.DataFrame(cars_dict)

In [6]:
# print the created dataframe
cars

   cars_per_cap        country  drives_right
0           809  United States         False
1           731      Australia          True
2           588          Japan          True
3            18          India          True
4           200         Russia         False
5            70        Morocco         False
6            45          Egypt         False

#### Importing CSV data files as pandas dataframes 

For the upcoming exercises, we will use a car dataset which holds the following information:

- Region Code 
- Country
- Coutry Code
- Car per capita
- Drives Right

In [7]:
# read the data from the csv file
cars = pd.read_csv('cars.csv')

# check the dataframe created
cars

    USCA   US United States    809  FALSE
0  ASPAC  AUS     Australia  731.0   True
1  ASPAC  JAP         Japan  588.0   True
2  ASPAC   IN         India   18.0   True
3  ASPAC   RU        Russia  200.0  False
4  LATAM  MOR       Morocco   70.0  False
5    AFR   EG         Egypt   45.0  False
6    EUR  ENG       England    NaN   True

As you can see from the dataframe above, the first row has been taken as the column header for the dataframe. Let's see how to prevent that.

In [8]:
# load the dataframe from the csv without any header
cars = pd.read_csv('cars.csv',header = None)

# check the dataframe created
cars

       0    1              2      3      4
0   USCA   US  United States  809.0  False
1  ASPAC  AUS      Australia  731.0   True
2  ASPAC  JAP          Japan  588.0   True
3  ASPAC   IN          India   18.0   True
4  ASPAC   RU         Russia  200.0  False
5  LATAM  MOR        Morocco   70.0  False
6    AFR   EG          Egypt   45.0  False
7    EUR  ENG        England    NaN   True

Now, the columns have the labels as 0, 1, 2, etc. The top row is now considered as a part of the row entries.

## Python Libraries - Pandas - Rows and Columns

### Indices and Labels

#### Indices 

An important concept in pandas dataframes is that of *row indices*. By default, each row is assigned indices starting from 0, and are represented at the left side of the dataframe. 

Now, arbitrary numeric indices are difficult to read and work with. Thus, you may want to change the indices of the dataframe to something more meanigful.

Let's change the index to the second column which stores the country codes, so that you can select rows using the country code directly.

In [9]:
# load the data into a dataframe with no header and index column as the second column
cars = pd.read_csv('cars.csv',header = None,index_col = 1)

# Check the created dataframe
cars

         0              2      3      4
1
US    USCA  United States  809.0  False
AUS  ASPAC      Australia  731.0   True
JAP  ASPAC          Japan  588.0   True
IN   ASPAC          India   18.0   True
RU   ASPAC         Russia  200.0  False
MOR  LATAM        Morocco   70.0  False
EG     AFR          Egypt   45.0  False
ENG    EUR        England    NaN   True

In [10]:
# Print the label of the index column
cars.index.name

1

In [11]:
# Remove the label of the index column
cars.index.name = ''

In [12]:
# Check the created dataframe
cars

         0              2      3      4

US    USCA  United States  809.0  False
AUS  ASPAC      Australia  731.0   True
JAP  ASPAC          Japan  588.0   True
IN   ASPAC          India   18.0   True
RU   ASPAC         Russia  200.0  False
MOR  LATAM        Morocco   70.0  False
EG     AFR          Egypt   45.0  False
ENG    EUR        England    NaN   True

Having meaningful row labels as indices helps you to select (subset) dataframes easily. You will study selecting dataframes in the next section. Let's now try to change the column headers.

#### Column headers

In [13]:
# Print the column headers of the dataframe
cars.columns

Int64Index([0, 2, 3, 4], dtype='int64')

In [14]:
# Change the label of each column
cars.columns = ['Region code','country','car per capital','drives right']

# Check the created dataframe
cars

    Region code        country  car per capital  drives right

US         USCA  United States            809.0         False
AUS       ASPAC      Australia            731.0          True
JAP       ASPAC          Japan            588.0          True
IN        ASPAC          India             18.0          True
RU        ASPAC         Russia            200.0         False
MOR       LATAM        Morocco             70.0         False
EG          AFR          Egypt             45.0         False
ENG         EUR        England              NaN          True

Without the labels, it will be very difficult to remember the information stored in the columns. Now you can easily make sense from the entries stored in the dataframe. Let's now try to define multiple indices in a dataframe.

#### Multi-indexing in Pandas

In [16]:
# Import the data from a csv file with multiple indices
cars =  pd.read_csv('cars.csv',header = None,index_col = [0,1])


# Check the created dataframe
cars

                       2      3      4
0     1
USCA  US   United States  809.0  False
ASPAC AUS      Australia  731.0   True
      JAP          Japan  588.0   True
      IN           India   18.0   True
      RU          Russia  200.0  False
LATAM MOR        Morocco   70.0  False
AFR   EG           Egypt   45.0  False
EUR   ENG        England    NaN   True

In [17]:
# Change the column names as above
cars.columns = ['country','car per capital','drives right']


# Check the created dataframe
cars

                 country  car per capital  drives right
0     1
USCA  US   United States            809.0         False
ASPAC AUS      Australia            731.0          True
      JAP          Japan            588.0          True
      IN           India             18.0          True
      RU          Russia            200.0         False
LATAM MOR        Morocco             70.0         False
AFR   EG           Egypt             45.0         False
EUR   ENG        England              NaN          True

In [19]:
# Print the index labels
cars.index.names

FrozenList([0, 1])

In [20]:
# Change the index labels: 0 - Region_code, 1 - Country_code
cars.index.names = ['Region code','Country code']

# Check the created dataframe
cars

                                country  car per capital  drives right
Region code Country code
USCA        US            United States            809.0         False
ASPAC       AUS               Australia            731.0          True
            JAP                   Japan            588.0          True
            IN                    India             18.0          True
            RU                   Russia            200.0         False
LATAM       MOR                 Morocco             70.0         False
AFR         EG                    Egypt             45.0         False
EUR         ENG                 England              NaN          True

In [24]:
# Print the inforamtion of the index in the dataframe
cars.index

MultiIndex([( 'USCA',  'US'),
            ('ASPAC', 'AUS'),
            ('ASPAC', 'JAP'),
            ('ASPAC',  'IN'),
            ('ASPAC',  'RU'),
            ('LATAM', 'MOR'),
            (  'AFR',  'EG'),
            (  'EUR', 'ENG')],
           names=['Region code', 'Country code'])

Multi-indexing is very useful to establish a hierarchy in the entries. It helps to segregate data into different categories and makes it easier to analyse the data.